Documents/гз_РазыгрываниеКонкурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>гз_РазыгрываниеКонкурса</Name>
			<BasedOn>
				<xr:Item>Document.гз_ОбъявлениеОПроведенииГосударственныхЗакупок</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.гз_ПредоставлениеУсловныхСкидок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРазыгрыванияКонкурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъявлениеОПроведенииЗакупок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гз_ОбъявлениеОПроведенииГосударственныхЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиКонкурса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_КритерииПредоставленияУсловныхСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКритерия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловнаяСкидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЧленыКонкурснойКомисии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/гз_РезультатыВскрытияЦеновыхПредложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>гз_РезультатыВскрытияЦеновыхПредложений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦеновоеПредложениеОтклонено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъявлениеОПроведенииКонкурса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гз_ОбъявлениеОПроведенииГосударственныхЗакупок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гз_ПредоставлениеУсловныхСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>гз_ПредоставлениеУсловныхСкидок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъявлениеОПроведенииЗакупок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гз_ОбъявлениеОПроведенииГосударственныхЗакупок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/гз_ОбъявлениеОПроведенииГосударственныхЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>гз_ОбъявлениеОПроведенииГосударственныхЗакупок</Name>
			<Comment>(гз)</Comment>
			<BasedOn>
				<xr:Item>Document.гз_ЗаказПодразделения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.гз_СостоянияТекущихЗаявок</xr:Item>
				<xr:Item>AccumulationRegister.гз_СостояниеКонкурсовПоГосударственнымЗакупкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделеннаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПроведенияКонкурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПроведенияКонкурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейПродления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Регл) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонкурсПродлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКонкурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонятьЦеновыеПредложенияСМеньшимКоличеством</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПродления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗакупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_СпособыЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПодписанияДоговоров</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставкиВДняхСМоментаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставкиСМоментаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гз_ЗаказПодразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Критерии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КритерийПредоставленияУсловныхСкидок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_КритерииПредоставленияУсловныхСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерАвансовогоПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.гз_СостоянияЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПоставкиВДняхСМоментаЗаключенияДоговора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтменаПозиции</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/гз_РазыгрываниеКонкурса/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет документ по документу-основанию
//
Процедура ЗаполнитьПоДокументуОснования(Основание) Экспорт
	 ОбъявлениеОПроведенииЗакупок 	= Основание.Ссылка;
	 Организация 					= Основание.Организация;
	 Дата 							= ТекущаяДата();
 КонецПроцедуры //ЗаполнитьПоДокументуОснования()
 
// Функция формирует список критериев по объявлению
//
// Возвращаемое значение:
//  Массив - список критериев
//  
Функция СформироватьСписокКритериев() Экспорт 
	
	 Запрос = Новый Запрос;
	 Запрос.УстановитьПараметр("ОбъявлениеОПроведенииЗакупок",ОбъявлениеОПроведенииЗакупок);
	 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	Критерии.КритерийПредоставленияУсловныхСкидок КАК Критерий,
	                |	Критерии.НомерСтроки
	                |ИЗ
	                |	Документ.гз_ОбъявлениеОПроведенииГосударственныхЗакупок.Критерии КАК Критерии
	                |ГДЕ
	                |	Критерии.Ссылка = &ОбъявлениеОПроведенииЗакупок
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Критерии.НомерСтроки";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Критерий");
	
КонецФункции // СформироватьСписокКритериев()

// Функция формирует запрос по объявлению
//
// Возвращаемое значение:
//  Массив - результат запроса по объявлению
//  
Функция СформироватьЗапросПоОбъявлению() Экспорт 
	
	 Запрос = Новый Запрос;
	 Запрос.УстановитьПараметр("ОбъявлениеОПроведенииЗакупок",ОбъявлениеОПроведенииЗакупок);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	гз_ЦеновоеПредложениеПоставщика.Контрагент
	               |ИЗ
	               |	Документ.гз_ЦеновоеПредложениеПоставщика КАК гз_ЦеновоеПредложениеПоставщика
	               |ГДЕ
	               |	гз_ЦеновоеПредложениеПоставщика.ДокументОснование = &ОбъявлениеОПроведенииЗакупок
	               |	И (НЕ гз_ЦеновоеПредложениеПоставщика.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	гз_РезультатыВскрытияЦеновыхПредложений.Поставщик КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.гз_РезультатыВскрытияЦеновыхПредложений КАК гз_РезультатыВскрытияЦеновыхПредложений
	               |ГДЕ
	               |	гз_РезультатыВскрытияЦеновыхПредложений.ОбъявлениеОПроведенииКонкурса = &ОбъявлениеОПроведенииЗакупок
	               |	И (НЕ гз_РезультатыВскрытияЦеновыхПредложений.ЦеновоеПредложениеОтклонено)";
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции // СформироватьЗапросПоОбъявлению()

// Функция выполняет проверку, сформированы ли итоги по объявлению-основанию
//
// Возвращаемое значение:
//  Истина, если по данному объявлению-основанию уже сформированы итоги государственных закупок, иначе - ложь
//  
Функция СформированыИтогиПоОбъявлению() Экспорт 
	
	// проверить, сформированы ли итоги гос закупок по объявлению, по которому сформирован данный документ
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование",ОбъявлениеОПроведенииЗакупок);
	Запрос.Текст = "ВЫБРАТЬ
				   |	гз_ИтогиГосударственныхЗакупок.Ссылка
				   |ИЗ
				   |	Документ.гз_ИтогиГосударственныхЗакупок КАК гз_ИтогиГосударственныхЗакупок
				   |ГДЕ
				   |	гз_ИтогиГосударственныхЗакупок.Проведен
				   |	И гз_ИтогиГосударственныхЗакупок.ДокументОснование = &ДокументОснование";
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // СформированыИтогиПоОбъявлению()
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура подготавливает таблицу движений
//
Процедура ПодготовитьТаблицуДвижений(ТаблицаДвижений,СтруктураШапкиДокумента)
	ТаблицаДвижений.Свернуть("Поставщик","УсловнаяСкидка");
	ТаблицаДвижений.Колонки.Добавить("Организация");
	ТаблицаДвижений.Колонки.Добавить("ОбъявлениеОПроведенииЗакупок");
	ТаблицаДвижений.Колонки.Добавить("Активность");
	ТаблицаДвижений.Колонки.Добавить("Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина,"Активность");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,					"Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ОбъявлениеОПроведенииЗакупок,	"ОбъявлениеОПроведенииЗакупок");
	ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Дата,							"Период");
	Для Каждого СтрокаЗаявка Из ТаблицаДвижений Цикл
		 СтрокаЗаявка.УсловнаяСкидка = ?(СтрокаЗаявка.УсловнаяСкидка < 100,СтрокаЗаявка.УсловнаяСкидка,100);
	КонецЦикла;
КонецПроцедуры //ПодготовитьТаблицуЗаявок()

// Процедура проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация"; // , ОперацияСОбъектамиОС - НЕ обязательна к заполнению
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	СтруктураОбязательныхПолей.Вставить("ОбъявлениеОПроведенииЗакупок");
	СтруктураОбязательныхПолей.Вставить("ДатаРазыгрыванияКонкурса");
	
	// Теперь позовем общую процедуру проверки.
	гз_ОбщегоНазначения.мПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбъявлениеОПроведенииЗакупок",	ОбъявлениеОПроведенииЗакупок);
		Запрос.УстановитьПараметр("Регистратор",					Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	гз_ПредоставлениеУсловныхСкидок.Регистратор
		               |ИЗ
		               |	РегистрСведений.гз_ПредоставлениеУсловныхСкидок КАК гз_ПредоставлениеУсловныхСкидок
		               |ГДЕ
		               |	гз_ПредоставлениеУсловныхСкидок.ОбъявлениеОПроведенииЗакупок = &ОбъявлениеОПроведенииЗакупок
		               |	И гз_ПредоставлениеУсловныхСкидок.Регистратор <> &Регистратор";
		Если НЕ Запрос.Выполнить().Пустой() Тогда
            Отказ = Истина;
			Сообщить("Разыгрывание конкурса "+Ссылка+" не может быть проведено:
			|	имеются другие розыгрыши данного конкурса!",СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //ПроверитьЗаполнениеШапки()

// Процедура формирования движений регистров
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаДвижений ,Отказ, Заголовок)
	Если Не Отказ Тогда
		Движения.гз_ПредоставлениеУсловныхСкидок.Загрузить(ТаблицаДвижений);
	КонецЕсли;
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ,РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = гз_ОбщегоНазначения.мПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если гз_ОбщегоНазначения.мРучнаяКорректировкаОбработкаПроведения(Ложь,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = гз_ОбщегоНазначения.мСформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Оплата НМА".
	
	ТаблицаДвижений 	= УчастникиКонкурса.Выгрузить();
	ПодготовитьТаблицуДвижений(ТаблицаДвижений,СтруктураШапкиДокумента);
	
	Если НЕ Отказ Тогда
		// Формирование движений регистров, бухгалтерских и налоговых проводок.
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаДвижений, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры //ОбработкаПроведения()

// Предопределенная процедура обработки удаления проведения документа
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	гз_ОбщегоНазначения.мУдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, Ложь);
КонецПроцедуры //ОбработкаУдаленияПроведения()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) =  Тип("ДокументСсылка.гз_ОбъявлениеОПроведенииГосударственныхЗакупок") Тогда
		ЗаполнитьПоДокументуОснования(Основание);
	КонецЕсли;
КонецПроцедуры //ОбработкаЗаполнения()

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ВнешняяОбработка") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбъявлениеОПроведенииЗакупок.Пустая() Тогда
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументОснование",ОбъявлениеОПроведенииЗакупок);
		Запрос.Текст = "ВЫБРАТЬ
		               |	гз_ИтогиГосударственныхЗакупок.Ссылка
		               |ИЗ
		               |	Документ.гз_ИтогиГосударственныхЗакупок КАК гз_ИтогиГосударственныхЗакупок
		               |ГДЕ
		               |	гз_ИтогиГосударственныхЗакупок.Проведен
		               |	И гз_ИтогиГосударственныхЗакупок.ДокументОснование = &ДокументОснование";
		Если Не Запрос.Выполнить().Пустой() Тогда
             Отказ = Истина;
			 Сообщить("Документ "+Ссылка+" не может быть записан, так как по конкурсу уже подведены итоги!",СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //ПередЗаписью()
